# SQL Assignment: Setting Up the Database Connection
In this assignment, you will learn how to connect to a database using `SQLAlchemy` and environment variables. Follow the steps below carefully to set up the connection to your database.

### Install all libraries
Let's start by installing all the libraries listed in `requirements.txt`:

In [1]:
# TODO: Run this cell to install libraries listed in `requirements.txt`
!pip install -r ../requirements.txt

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: sqlalchemy==1.4.0 in /home/vscode/.local/lib/python3.12/site-packages (from -r ../requirements.txt (line 2)) (1.4.0)
Requirement already satisfied: pandas==2.1.4 in /home/vscode/.local/lib/python3.12/site-packages (from -r ../requirements.txt (line 3)) (2.1.4)
Requirement already satisfied: python-dotenv==0.20.0 in /home/vscode/.local/lib/python3.12/site-packages (from -r ../requirements.txt (line 4)) (0.20.0)
Requirement already satisfied: psycopg2-binary==2.9.3 in /home/vscode/.local/lib/python3.12/site-packages (from -r ../requirements.txt (line 5)) (2.9.3)
Requirement already satisfied: numpy>=1.18.5 in /home/vscode/.local/lib/python3.12/site-packages (from -r ../requirements.txt (line 7)) (1.26.4)
Requirement already satisfied: jupyter==1.* in /home/vscode/.local/lib/python3.12/site-packages (from -r ../requirements.txt (line 12)) (1.1.1)
Requirement already satisfied: greenlet!=0.4.17 in /home/vscode/.local/lib/python3.12/site-packages (from sqlalchemy==1.4.0->-r ../requirements.txt (line 2)) (3.1.1)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/vscode/.local/lib/python3.12/site-packages (from pandas==2.1.4->-r ../requirements.txt (line 3)) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /home/vscode/.local/lib/python3.12/site-packages (from pandas==2.1.4->-r ../requirements.txt (line 3)) (2025.1)
Requirement already satisfied: tzdata>=2022.1 in /home/vscode/.local/lib/python3.12/site-packages (from pandas==2.1.4->-r ../requirements.txt (line 3)) (2025.1)
Requirement already satisfied: notebook in /home/vscode/.local/lib/python3.12/site-packages (from jupyter==1.*->-r ../requirements.txt (line 12)) (7.3.2)
Requirement already satisfied: jupyter-console in /home/vscode/.local/lib/python3.12/site-packages (from jupyter==1.*->-r ../requirements.txt (line 12)) (6.6.3)
Requirement already satisfied: nbconvert in /home/vscode/.local/lib/python3.12/site-packages (from jupyter==1.*->-r ../requirements.txt (line 12)) (7.16.6)
Requirement already satisfied: ipykernel in /home/vscode/.local/lib/python3.12/site-packages (from jupyter==1.*->-r ../requirements.txt (line 12)) (6.29.5)
Requirement already satisfied: ipywidgets in /home/vscode/.local/lib/python3.12/site-packages (from jupyter==1.*->-r ../requirements.txt (line 12)) (8.1.5)
Requirement already satisfied: jupyterlab in /home/vscode/.local/lib/python3.12/site-packages (from jupyter==1.*->-r ../requirements.txt (line 12)) (4.3.5)
Requirement already satisfied: six>=1.5 in /home/vscode/.local/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas==2.1.4->-r ../requirements.txt (line 3)) (1.17.0)
Requirement already satisfied: comm>=0.1.1 in /home/vscode/.local/lib/python3.12/site-packages (from ipykernel->jupyter==1.*->-r ../requirements.txt (line 12)) (0.2.2)
Requirement already satisfied: debugpy>=1.6.5 in /home/vscode/.local/lib/python3.12/site-packages (from ipykernel->jupyter==1.*->-r ../requirements.txt (line 12)) (1.8.12)
Requirement already satisfied: ipython>=7.23.1 in /home/vscode/.local/lib/python3.12/site-packages (from ipykernel->jupyter==1.*->-r ../requirements.txt (line 12)) (8.32.0)
Requirement already satisfied: jupyter-client>=6.1.12 in /home/vscode/.local/lib/python3.12/site-packages (from ipykernel->jupyter==1.*->-r ../requirements.txt (line 12)) (8.6.3)
Requirement already satisfied: jupyter-core!=5.0.*,>=4.12 in /home/vscode/.local/lib/python3.12/site-packages (from ipykernel->jupyter==1.*->-r ../requirements.txt (line 12)) (5.7.2)
Requirement already satisfied: matplotlib-inline>=0.1 in /home/vscode/.local/lib/python3.12/site-packages (from ipykernel->jupyter==1.*->-r ../requirements.txt (line 12)) (0.1.7)
Requirement already satisfied: nest-asyncio in /home/vscode/.local/lib/python3.12/site-packages (from ipykernel->jupyter==1.*->-r ../requirements.txt (line 12)) (1.6.0)
Requirement already satisfied: packaging in /home/vscode/.local/lib/python3.12/site-packages (from ipykernel->jupyter==1.*->-r ../requirements.txt (line 12)) (24.2)
Requirement already satisfied: psutil in /home/vscode/.local/lib/python3.12/site-packages (from ipykernel->jupyter==1.*->-r ../requirements.txt (line 12)) (6.1.1)
Requirement already satisfied: pyzmq>=24 in /home/vscode/.local/lib/python3.12/site-packages (from ipykernel->jupyter==1.*->-r ../requirements.txt (line 12)) (26.2.1)
Requirement already satisfied: tornado>=6.1 in /home/vscode/.local/lib/python3.12/site-packages (from ipykernel->jupyter==1.*->-r ../requirements.txt (line 12)) (6.4.2)
Requirement already satisfied: traitlets>=5.4.0 in /home/vscode/.local/lib/python3.12/site-packages (from ipykernel->jupyter==1.*->-r ../requirements.txt (line 12)) (5.14.3)
Requirement already satisfied: widgetsnbextension~=4.0.12 in /home/vscode/.local/lib/python3.12/site-packages (from ipywidgets->jupyter==1.*->-r ../requirements.txt (line 12)) (4.0.13)
Requirement already satisfied: jupyterlab-widgets~=3.0.12 in /home/vscode/.local/lib/python3.12/site-packages (from ipywidgets->jupyter==1.*->-r ../requirements.txt (line 12)) (3.0.13)
Requirement already satisfied: prompt-toolkit>=3.0.30 in /home/vscode/.local/lib/python3.12/site-packages (from jupyter-console->jupyter==1.*->-r ../requirements.txt (line 12)) (3.0.50)
Requirement already satisfied: pygments in /home/vscode/.local/lib/python3.12/site-packages (from jupyter-console->jupyter==1.*->-r ../requirements.txt (line 12)) (2.19.1)
Requirement already satisfied: async-lru>=1.0.0 in /home/vscode/.local/lib/python3.12/site-packages (from jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (2.0.4)
Requirement already satisfied: httpx>=0.25.0 in /home/vscode/.local/lib/python3.12/site-packages (from jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (0.28.1)
Requirement already satisfied: jinja2>=3.0.3 in /home/vscode/.local/lib/python3.12/site-packages (from jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (3.1.5)
Requirement already satisfied: jupyter-lsp>=2.0.0 in /home/vscode/.local/lib/python3.12/site-packages (from jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (2.2.5)
Requirement already satisfied: jupyter-server<3,>=2.4.0 in /home/vscode/.local/lib/python3.12/site-packages (from jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (2.15.0)
Requirement already satisfied: jupyterlab-server<3,>=2.27.1 in /home/vscode/.local/lib/python3.12/site-packages (from jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (2.27.3)
Requirement already satisfied: notebook-shim>=0.2 in /home/vscode/.local/lib/python3.12/site-packages (from jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (0.2.4)
Requirement already satisfied: setuptools>=40.8.0 in /usr/local/lib/python3.12/site-packages (from jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (69.0.3)
Requirement already satisfied: beautifulsoup4 in /home/vscode/.local/lib/python3.12/site-packages (from nbconvert->jupyter==1.*->-r ../requirements.txt (line 12)) (4.13.3)
Requirement already satisfied: bleach!=5.0.0 in /home/vscode/.local/lib/python3.12/site-packages (from bleach[css]!=5.0.0->nbconvert->jupyter==1.*->-r ../requirements.txt (line 12)) (6.2.0)
Requirement already satisfied: defusedxml in /home/vscode/.local/lib/python3.12/site-packages (from nbconvert->jupyter==1.*->-r ../requirements.txt (line 12)) (0.7.1)
Requirement already satisfied: jupyterlab-pygments in /home/vscode/.local/lib/python3.12/site-packages (from nbconvert->jupyter==1.*->-r ../requirements.txt (line 12)) (0.3.0)
Requirement already satisfied: markupsafe>=2.0 in /home/vscode/.local/lib/python3.12/site-packages (from nbconvert->jupyter==1.*->-r ../requirements.txt (line 12)) (3.0.2)
Requirement already satisfied: mistune<4,>=2.0.3 in /home/vscode/.local/lib/python3.12/site-packages (from nbconvert->jupyter==1.*->-r ../requirements.txt (line 12)) (3.1.1)
Requirement already satisfied: nbclient>=0.5.0 in /home/vscode/.local/lib/python3.12/site-packages (from nbconvert->jupyter==1.*->-r ../requirements.txt (line 12)) (0.10.2)
Requirement already satisfied: nbformat>=5.7 in /home/vscode/.local/lib/python3.12/site-packages (from nbconvert->jupyter==1.*->-r ../requirements.txt (line 12)) (5.10.4)
Requirement already satisfied: pandocfilters>=1.4.1 in /home/vscode/.local/lib/python3.12/site-packages (from nbconvert->jupyter==1.*->-r ../requirements.txt (line 12)) (1.5.1)
Requirement already satisfied: webencodings in /home/vscode/.local/lib/python3.12/site-packages (from bleach!=5.0.0->bleach[css]!=5.0.0->nbconvert->jupyter==1.*->-r ../requirements.txt (line 12)) (0.5.1)
Requirement already satisfied: tinycss2<1.5,>=1.1.0 in /home/vscode/.local/lib/python3.12/site-packages (from bleach[css]!=5.0.0->nbconvert->jupyter==1.*->-r ../requirements.txt (line 12)) (1.4.0)
Requirement already satisfied: anyio in /home/vscode/.local/lib/python3.12/site-packages (from httpx>=0.25.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (4.8.0)
Requirement already satisfied: certifi in /home/vscode/.local/lib/python3.12/site-packages (from httpx>=0.25.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (2025.1.31)
Requirement already satisfied: httpcore==1.* in /home/vscode/.local/lib/python3.12/site-packages (from httpx>=0.25.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (1.0.7)
Requirement already satisfied: idna in /home/vscode/.local/lib/python3.12/site-packages (from httpx>=0.25.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (3.10)
Requirement already satisfied: h11<0.15,>=0.13 in /home/vscode/.local/lib/python3.12/site-packages (from httpcore==1.*->httpx>=0.25.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (0.14.0)
Requirement already satisfied: decorator in /home/vscode/.local/lib/python3.12/site-packages (from ipython>=7.23.1->ipykernel->jupyter==1.*->-r ../requirements.txt (line 12)) (5.1.1)
Requirement already satisfied: jedi>=0.16 in /home/vscode/.local/lib/python3.12/site-packages (from ipython>=7.23.1->ipykernel->jupyter==1.*->-r ../requirements.txt (line 12)) (0.19.2)
Requirement already satisfied: pexpect>4.3 in /home/vscode/.local/lib/python3.12/site-packages (from ipython>=7.23.1->ipykernel->jupyter==1.*->-r ../requirements.txt (line 12)) (4.9.0)
Requirement already satisfied: stack_data in /home/vscode/.local/lib/python3.12/site-packages (from ipython>=7.23.1->ipykernel->jupyter==1.*->-r ../requirements.txt (line 12)) (0.6.3)
Requirement already satisfied: platformdirs>=2.5 in /home/vscode/.local/lib/python3.12/site-packages (from jupyter-core!=5.0.*,>=4.12->ipykernel->jupyter==1.*->-r ../requirements.txt (line 12)) (4.3.6)
Requirement already satisfied: argon2-cffi>=21.1 in /home/vscode/.local/lib/python3.12/site-packages (from jupyter-server<3,>=2.4.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (23.1.0)
Requirement already satisfied: jupyter-events>=0.11.0 in /home/vscode/.local/lib/python3.12/site-packages (from jupyter-server<3,>=2.4.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (0.12.0)
Requirement already satisfied: jupyter-server-terminals>=0.4.4 in /home/vscode/.local/lib/python3.12/site-packages (from jupyter-server<3,>=2.4.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (0.5.3)
Requirement already satisfied: overrides>=5.0 in /home/vscode/.local/lib/python3.12/site-packages (from jupyter-server<3,>=2.4.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (7.7.0)
Requirement already satisfied: prometheus-client>=0.9 in /home/vscode/.local/lib/python3.12/site-packages (from jupyter-server<3,>=2.4.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (0.21.1)
Requirement already satisfied: send2trash>=1.8.2 in /home/vscode/.local/lib/python3.12/site-packages (from jupyter-server<3,>=2.4.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (1.8.3)
Requirement already satisfied: terminado>=0.8.3 in /home/vscode/.local/lib/python3.12/site-packages (from jupyter-server<3,>=2.4.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (0.18.1)
Requirement already satisfied: websocket-client>=1.7 in /home/vscode/.local/lib/python3.12/site-packages (from jupyter-server<3,>=2.4.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (1.8.0)
Requirement already satisfied: babel>=2.10 in /home/vscode/.local/lib/python3.12/site-packages (from jupyterlab-server<3,>=2.27.1->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (2.17.0)
Requirement already satisfied: json5>=0.9.0 in /home/vscode/.local/lib/python3.12/site-packages (from jupyterlab-server<3,>=2.27.1->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (0.10.0)
Requirement already satisfied: jsonschema>=4.18.0 in /home/vscode/.local/lib/python3.12/site-packages (from jupyterlab-server<3,>=2.27.1->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (4.23.0)
Requirement already satisfied: requests>=2.31 in /home/vscode/.local/lib/python3.12/site-packages (from jupyterlab-server<3,>=2.27.1->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (2.32.3)
Requirement already satisfied: fastjsonschema>=2.15 in /home/vscode/.local/lib/python3.12/site-packages (from nbformat>=5.7->nbconvert->jupyter==1.*->-r ../requirements.txt (line 12)) (2.21.1)
Requirement already satisfied: wcwidth in /home/vscode/.local/lib/python3.12/site-packages (from prompt-toolkit>=3.0.30->jupyter-console->jupyter==1.*->-r ../requirements.txt (line 12)) (0.2.13)
Requirement already satisfied: soupsieve>1.2 in /home/vscode/.local/lib/python3.12/site-packages (from beautifulsoup4->nbconvert->jupyter==1.*->-r ../requirements.txt (line 12)) (2.6)
Requirement already satisfied: typing-extensions>=4.0.0 in /home/vscode/.local/lib/python3.12/site-packages (from beautifulsoup4->nbconvert->jupyter==1.*->-r ../requirements.txt (line 12)) (4.12.2)
Requirement already satisfied: sniffio>=1.1 in /home/vscode/.local/lib/python3.12/site-packages (from anyio->httpx>=0.25.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (1.3.1)
Requirement already satisfied: argon2-cffi-bindings in /home/vscode/.local/lib/python3.12/site-packages (from argon2-cffi>=21.1->jupyter-server<3,>=2.4.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (21.2.0)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in /home/vscode/.local/lib/python3.12/site-packages (from jedi>=0.16->ipython>=7.23.1->ipykernel->jupyter==1.*->-r ../requirements.txt (line 12)) (0.8.4)
Requirement already satisfied: attrs>=22.2.0 in /home/vscode/.local/lib/python3.12/site-packages (from jsonschema>=4.18.0->jupyterlab-server<3,>=2.27.1->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (25.1.0)
Requirement already satisfied: jsonschema-specifications>=2023.03.6 in /home/vscode/.local/lib/python3.12/site-packages (from jsonschema>=4.18.0->jupyterlab-server<3,>=2.27.1->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (2024.10.1)
Requirement already satisfied: referencing>=0.28.4 in /home/vscode/.local/lib/python3.12/site-packages (from jsonschema>=4.18.0->jupyterlab-server<3,>=2.27.1->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (0.36.2)
Requirement already satisfied: rpds-py>=0.7.1 in /home/vscode/.local/lib/python3.12/site-packages (from jsonschema>=4.18.0->jupyterlab-server<3,>=2.27.1->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (0.22.3)
Requirement already satisfied: python-json-logger>=2.0.4 in /home/vscode/.local/lib/python3.12/site-packages (from jupyter-events>=0.11.0->jupyter-server<3,>=2.4.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (3.2.1)
Requirement already satisfied: pyyaml>=5.3 in /home/vscode/.local/lib/python3.12/site-packages (from jupyter-events>=0.11.0->jupyter-server<3,>=2.4.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (6.0.2)
Requirement already satisfied: rfc3339-validator in /home/vscode/.local/lib/python3.12/site-packages (from jupyter-events>=0.11.0->jupyter-server<3,>=2.4.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (0.1.4)
Requirement already satisfied: rfc3986-validator>=0.1.1 in /home/vscode/.local/lib/python3.12/site-packages (from jupyter-events>=0.11.0->jupyter-server<3,>=2.4.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (0.1.1)
Requirement already satisfied: ptyprocess>=0.5 in /home/vscode/.local/lib/python3.12/site-packages (from pexpect>4.3->ipython>=7.23.1->ipykernel->jupyter==1.*->-r ../requirements.txt (line 12)) (0.7.0)
Requirement already satisfied: charset-normalizer<4,>=2 in /home/vscode/.local/lib/python3.12/site-packages (from requests>=2.31->jupyterlab-server<3,>=2.27.1->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (3.4.1)
Requirement already satisfied: urllib3<3,>=1.21.1 in /home/vscode/.local/lib/python3.12/site-packages (from requests>=2.31->jupyterlab-server<3,>=2.27.1->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (2.3.0)
Requirement already satisfied: executing>=1.2.0 in /home/vscode/.local/lib/python3.12/site-packages (from stack_data->ipython>=7.23.1->ipykernel->jupyter==1.*->-r ../requirements.txt (line 12)) (2.2.0)
Requirement already satisfied: asttokens>=2.1.0 in /home/vscode/.local/lib/python3.12/site-packages (from stack_data->ipython>=7.23.1->ipykernel->jupyter==1.*->-r ../requirements.txt (line 12)) (3.0.0)
Requirement already satisfied: pure-eval in /home/vscode/.local/lib/python3.12/site-packages (from stack_data->ipython>=7.23.1->ipykernel->jupyter==1.*->-r ../requirements.txt (line 12)) (0.2.3)
Requirement already satisfied: fqdn in /home/vscode/.local/lib/python3.12/site-packages (from jsonschema[format-nongpl]>=4.18.0->jupyter-events>=0.11.0->jupyter-server<3,>=2.4.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (1.5.1)
Requirement already satisfied: isoduration in /home/vscode/.local/lib/python3.12/site-packages (from jsonschema[format-nongpl]>=4.18.0->jupyter-events>=0.11.0->jupyter-server<3,>=2.4.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (20.11.0)
Requirement already satisfied: jsonpointer>1.13 in /home/vscode/.local/lib/python3.12/site-packages (from jsonschema[format-nongpl]>=4.18.0->jupyter-events>=0.11.0->jupyter-server<3,>=2.4.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (3.0.0)
Requirement already satisfied: uri-template in /home/vscode/.local/lib/python3.12/site-packages (from jsonschema[format-nongpl]>=4.18.0->jupyter-events>=0.11.0->jupyter-server<3,>=2.4.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (1.3.0)
Requirement already satisfied: webcolors>=24.6.0 in /home/vscode/.local/lib/python3.12/site-packages (from jsonschema[format-nongpl]>=4.18.0->jupyter-events>=0.11.0->jupyter-server<3,>=2.4.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (24.11.1)
Requirement already satisfied: cffi>=1.0.1 in /home/vscode/.local/lib/python3.12/site-packages (from argon2-cffi-bindings->argon2-cffi>=21.1->jupyter-server<3,>=2.4.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (1.17.1)
Requirement already satisfied: pycparser in /home/vscode/.local/lib/python3.12/site-packages (from cffi>=1.0.1->argon2-cffi-bindings->argon2-cffi>=21.1->jupyter-server<3,>=2.4.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (2.22)
Requirement already satisfied: arrow>=0.15.0 in /home/vscode/.local/lib/python3.12/site-packages (from isoduration->jsonschema[format-nongpl]>=4.18.0->jupyter-events>=0.11.0->jupyter-server<3,>=2.4.0->jupyterlab->jupyter==1.*->-r ../requirements.txt (line 12)) (1.3.0)

### Create a `.env` file
1. In the root directory of your project, you should see a file named `.env.example`. This file provides a template for setting up your database connection variables.

2. Duplicate the `.env.example` file and rename the copy to `.env`. You can do this in your terminal or file explorer.
    - In the terminal, run the following command:

        ```python
        cp .env.example .env
        ```

3. Open the `.env` file and modify the following line:

    ```python
    DB_NAME = '<your database name>'
    ```

    Replace `<your database name>` with the name of your custom database. For example:

    ```python
    DB_NAME = 'my_database'
    ```

4. Save the changes to the `.env` file.

### Verify Your `.env` File Setup
1. Run the following code cell to confirm that the environment variables in your `.env` file are being loaded correctly:

In [2]:
# TODO: Run this cell to import the necessary libraries and load your variables you set in your .env file
import os
from sqlalchemy import create_engine, inspect
import pandas as pd
from dotenv import load_dotenv

# Load the .env file variables
# The output of this command should be `True`
# If the output is `False`, that means you did not create a valid .env file in the root directory of this project
load_dotenv()

True

2. If your `.env` file is set up correctly, the command should return `True`. If it returns `False`, check the following:

    - Ensure the `.env` file is located in the **root directory** of your project.

    - Double-check that you replaced `<your database name>` with your actual database name.

    - Make sure there are no syntax errors in the `.env` file (e.g., no extra spaces or missing values).

3. You can also validate and inspect your environment variables by running the following code cell:

In [3]:
# Inspect the environment variables
print(os.getenv('DB_USER'))
print(os.getenv('DB_HOST'))
print(os.getenv('DB_NAME'))
print(os.getenv('DB_PASSWORD'))

gitpod
localhost
gabe
postgres

### Connecting to the Database
Now that you have set up your `.env` file and confirmed the environment variables are loaded correctly, it’s time to establish a connection to your database using `SQLAlchemy`'s `create_engine` function. 

1. Run the following code to establish a connection:

In [30]:
# 1) Connect to the database here using the SQLAlchemy's `create_engine`` function
# A "connection string" is basically a string containing all database credentials together.
connection_string = f"postgresql://{os.getenv('DB_USER')}:{os.getenv('DB_PASSWORD')}@{os.getenv('DB_HOST')}/{os.getenv('DB_NAME')}"
engine = create_engine(connection_string)
engine.connect()
print("Starting the connection...")

Starting the connection...

2. **Handling the `... FATAL:  database "<DB_NAME>" does not exist` Error**

    - If the connection attempt throws the following error:

        ```python
        ... FATAL:  database "<DB_NAME>" does not exist
        ```

        This means your database hasn't been created yet. To fix this, follow theses steps:

    - Open your **terminal**

    - Run the following command to create your database, making sure to replace `<DB_USER>` and `<DB_NAME>` with the values you set in your `.env` file:

        ```python
        createdb -h localhost -U <DB_USER> <DB_NAME>
        ```

        For example, if you set `DB_USER` to `gitpod` and `DB_NAME` to `marisols_database`, the command would be:

        ```python
        createdb -h localhost -U gitpod marisols_database
        ```

    - If prompted, enter the password you set in your `.env` file for the `DB_USER`

    - Rerun the code cell above. If successfull, the output will be `Starting the connection...`

### Inspecting the Database for Tables
Now that you've connected to the database, let's check whether any tables currently exist. Since you haven't created any tables yet, the output should be an empty list.

`SQLAlchemy` provides a helpful function called `inspect` to examine the database. In this step, you'll use it to list all existing tables in the database.

Run the following code to inspect the database:

In [5]:
# We can inspect our database by creating an inspector object
inspector = inspect(engine)

# Get the table names
table_names = inspector.get_table_names()

# Print the table names
print(f"Existing tables in the database: {table_names}")

Existing tables in the database: []

Since the database is currently empty (you haven’t created any tables yet).

### Creating Tables in the Database
We need to create four tables: `publishers`, `authors`, `books`, and `book_authors`, with foreign key relationships between them. These relationships will help organize the data logically and maintain integrity.

- **Check if a table exists**: To avoid errors from trying to create a table that already exists, we use `CREATE TABLE IF NOT EXISTS`. This ensures that the table is created only if it doesn't already exist in the database.

Run the following code to create the tables:

In [6]:
from sqlalchemy import text

# Connect to the database
with engine.begin() as connection:
    # Execute the SQL statements to create tables
    connection.execute(text("""
    CREATE TABLE IF NOT EXISTS publishers(
        publisher_id INT NOT NULL,
        name VARCHAR(255) NOT NULL,
        PRIMARY KEY(publisher_id)
    );

    CREATE TABLE IF NOT EXISTS authors(
        author_id INT NOT NULL,
        first_name VARCHAR(100) NOT NULL,
        middle_name VARCHAR(50) NULL,
        last_name VARCHAR(100) NULL,
        PRIMARY KEY(author_id)
    );

    CREATE TABLE IF NOT EXISTS books(
        book_id INT NOT NULL,
        title VARCHAR(255) NOT NULL,
        total_pages INT NULL,
        rating DECIMAL(4, 2) NULL,
        isbn VARCHAR(13) NULL,
        published_date DATE,
        publisher_id INT NULL,
        PRIMARY KEY(book_id),
        CONSTRAINT fk_publisher FOREIGN KEY(publisher_id) REFERENCES publishers(publisher_id)
    );

    CREATE TABLE IF NOT EXISTS book_authors (
        book_id INT NOT NULL,
        author_id INT NOT NULL,
        PRIMARY KEY(book_id, author_id),
        CONSTRAINT fk_book FOREIGN KEY(book_id) REFERENCES books(book_id) ON DELETE CASCADE,
        CONSTRAINT fk_author FOREIGN KEY(author_id) REFERENCES authors(author_id) ON DELETE CASCADE
    );
    """))

After running the SQL statements, you can re-inspect the database to confirm that the tables were created successfully:

In [7]:
# Let's inspect out database again to confirm that the tables were created
inspector = inspect(engine)

# Get the table names
table_names = inspector.get_table_names()

# Print the table names
print(f"Existing tables in the database: {table_names}")

Existing tables in the database: ['publishers', 'books', 'book_authors', 'authors']

### Inserting Data into the Tables
Now you will insert sample data into the tables you created earlier: `publishers`, `authors`, `books`, and `book_authors`. This will allow you to work with real data in your database for further queries and analyses.

In [8]:
# Execute the SQL sentences to insert data into tables
with engine.begin() as connection:
    connection.execute(text("""
    INSERT INTO publishers(publisher_id, name) VALUES (1, 'O Reilly Media');
    INSERT INTO publishers(publisher_id, name) VALUES (2, 'A Book Apart');
    INSERT INTO publishers(publisher_id, name) VALUES (3, 'A K PETERS');
    INSERT INTO publishers(publisher_id, name) VALUES (4, 'Academic Press');
    INSERT INTO publishers(publisher_id, name) VALUES (5, 'Addison Wesley');
    INSERT INTO publishers(publisher_id, name) VALUES (6, 'Albert&Sweigart');
    INSERT INTO publishers(publisher_id, name) VALUES (7, 'Alfred A. Knopf');

    INSERT INTO authors (author_id, first_name, middle_name, last_name) VALUES (1, 'Merritt', null, 'Eric');
    INSERT INTO authors (author_id, first_name, middle_name, last_name) VALUES (2, 'Linda', null, 'Mui');
    INSERT INTO authors (author_id, first_name, middle_name, last_name) VALUES (3, 'Alecos', null, 'Papadatos');
    INSERT INTO authors (author_id, first_name, middle_name, last_name) VALUES (4, 'Anthony', null, 'Molinaro');
    INSERT INTO authors (author_id, first_name, middle_name, last_name) VALUES (5, 'David', null, 'Cronin');
    INSERT INTO authors (author_id, first_name, middle_name, last_name) VALUES (6, 'Richard', null, 'Blum');
    INSERT INTO authors (author_id, first_name, middle_name, last_name) VALUES (7, 'Yuval', 'Noah', 'Harari');
    INSERT INTO authors (author_id, first_name, middle_name, last_name) VALUES (8, 'Paul', null, 'Albitz');

    INSERT INTO books (book_id, title, total_pages, rating, isbn, published_date, publisher_id) VALUES (1, 'Lean Software Development: An Agile Toolkit', 240, 4.17, '9780320000000', '2003-05-18', 5);
    INSERT INTO books (book_id, title, total_pages, rating, isbn, published_date, publisher_id) VALUES (2, 'Facing the Intelligence Explosion', 91, 3.87, null, '2013-02-01', 7);
    INSERT INTO books (book_id, title, total_pages, rating, isbn, published_date, publisher_id) VALUES (3, 'Scala in Action', 419, 3.74, '9781940000000', '2013-04-10', 1);
    INSERT INTO books (book_id, title, total_pages, rating, isbn, published_date, publisher_id) VALUES (4, 'Patterns of Software: Tales from the Software Community', 256, 3.84, '9780200000000', '1996-08-15', 1);
    INSERT INTO books (book_id, title, total_pages, rating, isbn, published_date, publisher_id) VALUES (5, 'Anatomy Of LISP', 446, 4.43, '9780070000000', '1978-01-01', 3);
    INSERT INTO books (book_id, title, total_pages, rating, isbn, published_date, publisher_id) VALUES (6, 'Computing machinery and intelligence', 24, 4.17, null, '2009-03-22', 4);
    INSERT INTO books (book_id, title, total_pages, rating, isbn, published_date, publisher_id) VALUES (7, 'XML: Visual QuickStart Guide', 269, 3.66, '9780320000000', '2009-01-01', 5);
    INSERT INTO books (book_id, title, total_pages, rating, isbn, published_date, publisher_id) VALUES (8, 'SQL Cookbook', 595, 3.95, '9780600000000', '2005-12-01', 7);
    INSERT INTO books (book_id, title, total_pages, rating, isbn, published_date, publisher_id) VALUES (9, 'The Apollo Guidance Computer: Architecture And Operation (Springer Praxis Books / Space Exploration)', 439, 4.29, '9781440000000', '2010-07-01', 6);
    INSERT INTO books (book_id, title, total_pages, rating, isbn, published_date, publisher_id) VALUES (10, 'Minds and Computers: An Introduction to the Philosophy of Artificial Intelligence', 222, 3.54, '9780750000000', '2007-02-13', 7);

    INSERT INTO book_authors (book_id, author_id) VALUES (1, 1);
    INSERT INTO book_authors (book_id, author_id) VALUES (2, 8);
    INSERT INTO book_authors (book_id, author_id) VALUES (3, 7);
    INSERT INTO book_authors (book_id, author_id) VALUES (4, 6);
    INSERT INTO book_authors (book_id, author_id) VALUES (5, 5);
    INSERT INTO book_authors (book_id, author_id) VALUES (6, 4);
    INSERT INTO book_authors (book_id, author_id) VALUES (7, 3);
    INSERT INTO book_authors (book_id, author_id) VALUES (8, 2);
    INSERT INTO book_authors (book_id, author_id) VALUES (9, 4);
    INSERT INTO book_authors (book_id, author_id) VALUES (10, 1);
    """))

### Load SQL Tables into Pandas DataFrames
We will use the `pandas` library to read the data from the SQL tables we created and inserted data into in the previous step. The `pd.read_sql` function allows us to execute SQL queries and return the results as pandas DataFrames.

This is useful for analyzing and manipulating the data programmatically. Below are the commands to load each table into its respective DataFrame:

In [9]:
# Use pandas to print one of the tables as dataframe using read_sql function
# Here we are reading the publishers table as a pandas dataframe
publishers_df = pd.read_sql("SELECT * FROM publishers;", engine)
publishers_df

   publisher_id             name
0             1   O Reilly Media
1             2     A Book Apart
2             3       A K PETERS
3             4   Academic Press
4             5   Addison Wesley
5             6  Albert&Sweigart
6             7  Alfred A. Knopf

In [10]:
# authors table
authors_df = pd.read_sql("SELECT * FROM authors;", engine)
authors_df

   author_id first_name middle_name  last_name
0          1    Merritt        None       Eric
1          2      Linda        None        Mui
2          3     Alecos        None  Papadatos
3          4    Anthony        None   Molinaro
4          5      David        None     Cronin
5          6    Richard        None       Blum
6          7      Yuval        Noah     Harari
7          8       Paul        None     Albitz

In [11]:
# books table
books_df = pd.read_sql("SELECT * FROM books;", engine)
books_df

,book_id,title,total_pages,rating,isbn,published_date,publisher_id
0,1,Lean Software Development: An Agile Toolkit,240,4.17,9780320000000,2003-05-18,5
1,2,Facing the Intelligence Explosion,91,3.87,None,2013-02-01,7
2,3,Scala in Action,419,3.74,9781940000000,2013-04-10,1
3,4,Patterns of Software: Tales from the Software ...,256,3.84,9780200000000,1996-08-15,1
4,5,Anatomy Of LISP,446,4.43,9780070000000,1978-01-01,3
5,6,Computing machinery and intelligence,24,4.17,None,2009-03-22,4
6,7,XML: Visual QuickStart Guide,269,3.66,9780320000000,2009-01-01,5
7,8,SQL Cookbook,595,3.95,9780600000000,2005-12-01,7
8,9,The Apollo Guidance Computer: Architecture And...,439,4.29,9781440000000,2010-07-01,6
9,10,Minds and Computers: An Introduction to the Ph...,222,3.54,9780750000000,2007-02-13,7

In [12]:
# book_authors table
book_authors_df = pd.read_sql("SELECT * FROM book_authors;", engine)
book_authors_df

   book_id  author_id
0        1          1
1        2          8
2        3          7
3        4          6
4        5          5
5        6          4
6        7          3
7        8          2
8        9          4
9       10          1

## SQL Data Exploration and Analysis
In this section, you will complete 15 exercises that require you to write SQL queries to extract insights from the `publishers`, `authors`, `books`, and `book_authors` tables.

Read each prompt carefully, then write and execute the appropriate SQL query using the provided SQLAlchemy `engine`. Aim to complete all exercises to enhance your SQL skills and deepen your understanding of data manipulation.

In [13]:
# 1. Write a SQL query to select all columns and rows from the `books` table. 
# (Hint: Use `*`)
all_books = pd.read_sql("SELECT * FROM books", engine)
all_books

,book_id,title,total_pages,rating,isbn,published_date,publisher_id
0,1,Lean Software Development: An Agile Toolkit,240,4.17,9780320000000,2003-05-18,5
1,2,Facing the Intelligence Explosion,91,3.87,None,2013-02-01,7
2,3,Scala in Action,419,3.74,9781940000000,2013-04-10,1
3,4,Patterns of Software: Tales from the Software ...,256,3.84,9780200000000,1996-08-15,1
4,5,Anatomy Of LISP,446,4.43,9780070000000,1978-01-01,3
5,6,Computing machinery and intelligence,24,4.17,None,2009-03-22,4
6,7,XML: Visual QuickStart Guide,269,3.66,9780320000000,2009-01-01,5
7,8,SQL Cookbook,595,3.95,9780600000000,2005-12-01,7
8,9,The Apollo Guidance Computer: Architecture And...,439,4.29,9781440000000,2010-07-01,6
9,10,Minds and Computers: An Introduction to the Ph...,222,3.54,9780750000000,2007-02-13,7

In [14]:
# 2. Write a SQL query to select the first 3 rows from the `books` table. 
# (Hint: Use `LIMIT n` where n is the number of rows)
top_three_rows = pd.read_sql("SELECT * FROM books LIMIT 3;", engine)
top_three_rows

,book_id,title,total_pages,rating,isbn,published_date,publisher_id
0,1,Lean Software Development: An Agile Toolkit,240,4.17,9780320000000,2003-05-18,5
1,2,Facing the Intelligence Explosion,91,3.87,None,2013-02-01,7
2,3,Scala in Action,419,3.74,9781940000000,2013-04-10,1

In [15]:
# 3. Write a SQL query to select only the `first_name` column of the `authors` table`.
authors_first_names = pd.read_sql("SELECT first_name FROM authors", engine)
authors_first_names

  first_name
0    Merritt
1      Linda
2     Alecos
3    Anthony
4      David
5    Richard
6      Yuval
7       Paul

In [16]:
# 4. Write a SQL query to to select only the `title` column of the `books` table`.
book_titles = pd.read_sql("SELECT first_name FROM authors;", engine)
book_titles

  first_name
0    Merritt
1      Linda
2     Alecos
3    Anthony
4      David
5    Richard
6      Yuval
7       Paul

In [17]:
# 5. Write a SQL query to select only the `name` column of the `publishers` table`.
publishers = pd.read_sql("SELECT name FROM publishers", engine)
publishers

              name
0   O Reilly Media
1     A Book Apart
2       A K PETERS
3   Academic Press
4   Addison Wesley
5  Albert&Sweigart
6  Alfred A. Knopf

In [18]:
# 6. Write a SQL query to select the `title` and `published_date` columns of the `books` table`.
book_dates = pd.read_sql("SELECT published_date FROM books", engine)
book_dates

  published_date
0     2003-05-18
1     2013-02-01
2     2013-04-10
3     1996-08-15
4     1978-01-01
5     2009-03-22
6     2009-01-01
7     2005-12-01
8     2010-07-01
9     2007-02-13

In [19]:
# 7. Write a SQL query to count the number of rows listed in the `authors` table. 
# (Hint: Use the `COUNT()` command)
row_count = pd.read_sql("SELECT COUNT(*) FROM authors", engine)
row_count

   count
0      8

In [20]:
# 8. Write a SQL query to find the sum of `total_pages` using the `books` table. 
# (Hint: Use the `SUM()` command)
sum_total_pages = pd.read_sql("SELECT SUM(total_pages) FROM books", engine)
sum_total_pages

    sum
0  3001

In [21]:
# 9. Write a SQL query to find the average book `rating` using the `books` table. 
# (Hint: Use the `AVG()` command)
avg_rating = pd.read_sql("books", engine)
avg_rating

,book_id,title,total_pages,rating,isbn,published_date,publisher_id
0,1,Lean Software Development: An Agile Toolkit,240,4.17,9780320000000,2003-05-18,5
1,2,Facing the Intelligence Explosion,91,3.87,None,2013-02-01,7
2,3,Scala in Action,419,3.74,9781940000000,2013-04-10,1
3,4,Patterns of Software: Tales from the Software ...,256,3.84,9780200000000,1996-08-15,1
4,5,Anatomy Of LISP,446,4.43,9780070000000,1978-01-01,3
5,6,Computing machinery and intelligence,24,4.17,None,2009-03-22,4
6,7,XML: Visual QuickStart Guide,269,3.66,9780320000000,2009-01-01,5
7,8,SQL Cookbook,595,3.95,9780600000000,2005-12-01,7
8,9,The Apollo Guidance Computer: Architecture And...,439,4.29,9781440000000,2010-07-01,6
9,10,Minds and Computers: An Introduction to the Ph...,222,3.54,9780750000000,2007-02-13,7

In [22]:
# 10. Write a SQL query to find the minimum book `rating` using the `books` table. 
# (Hint: Use the `MIN()` command)
min_rating = pd.read_sql("SELECT AVG(rating) FROM books;", engine)
min_rating

     avg
0  3.966

In [23]:
# 11. Write a SQL query to find the maximum book `rating` using the `books` table. 
# (Hint: Use the `MAX()` command)
max_rating = pd.read_sql("SELECT MAX(rating) FROM books", engine)
max_rating

    max
0  4.43

In [24]:
# 12. Write a SQL query to list the rows in the `books` table where `isbn` is not None. 
# (Hint: Use the `WHERE()` command)
non_null_isbn_rows = pd.read_sql("SELECT * FROM books WHERE isbn IS NOT NULL", engine)
non_null_isbn_rows

,book_id,title,total_pages,rating,isbn,published_date,publisher_id
0,1,Lean Software Development: An Agile Toolkit,240,4.17,9780320000000,2003-05-18,5
1,3,Scala in Action,419,3.74,9781940000000,2013-04-10,1
2,4,Patterns of Software: Tales from the Software ...,256,3.84,9780200000000,1996-08-15,1
3,5,Anatomy Of LISP,446,4.43,9780070000000,1978-01-01,3
4,7,XML: Visual QuickStart Guide,269,3.66,9780320000000,2009-01-01,5
5,8,SQL Cookbook,595,3.95,9780600000000,2005-12-01,7
6,9,The Apollo Guidance Computer: Architecture And...,439,4.29,9781440000000,2010-07-01,6
7,10,Minds and Computers: An Introduction to the Ph...,222,3.54,9780750000000,2007-02-13,7

In [25]:
# 13. Write a SQL query to list the rows in the `books` table where `total_pages` is greater than 400. 
# (Hint: Use the `WHERE()` command)
large_books = pd.read_sql("SELECT * FROM books WHERE total_pages > 400", engine)
large_books

,book_id,title,total_pages,rating,isbn,published_date,publisher_id
0,3,Scala in Action,419,3.74,9781940000000,2013-04-10,1
1,5,Anatomy Of LISP,446,4.43,9780070000000,1978-01-01,3
2,8,SQL Cookbook,595,3.95,9780600000000,2005-12-01,7
3,9,The Apollo Guidance Computer: Architecture And...,439,4.29,9781440000000,2010-07-01,6

In [26]:
# 14. Write a SQL query to list the rows in the `books` table where `published_date` is before 2000-01-01. 
# (Hint: Use the `WHERE()` command)
old_books = pd.read_sql("SELECT * FROM books WHERE published_date < '2000-01-01'", engine)
old_books

,book_id,title,total_pages,rating,isbn,published_date,publisher_id
0,4,Patterns of Software: Tales from the Software ...,256,3.84,9780200000000,1996-08-15,1
1,5,Anatomy Of LISP,446,4.43,9780070000000,1978-01-01,3

In [27]:
# 15. Write a SQL query to list the book titles along with the first name of the author. 
# (Hint: Several JOINs may be needed)

book_info = pd.read_sql(
    """
    SELECT books.title, authors.first_name
    FROM books
    JOIN book_authors ON books.book_id = book_authors.book_id
    JOIN authors ON authors.author_id = book_authors.author_id
    """,
    engine
)

book_info

                                               title first_name
0        Lean Software Development: An Agile Toolkit    Merritt
1                  Facing the Intelligence Explosion       Paul
2                                    Scala in Action      Yuval
3  Patterns of Software: Tales from the Software ...    Richard
4                                    Anatomy Of LISP      David
5               Computing machinery and intelligence    Anthony
6                       XML: Visual QuickStart Guide     Alecos
7                                       SQL Cookbook      Linda
8  The Apollo Guidance Computer: Architecture And...    Anthony
9  Minds and Computers: An Introduction to the Ph...    Merritt

## How to clear the database

In [28]:
# Let's clear our database by dropping all our tables
with engine.begin() as connection:
    connection.execute(text("""
        DROP TABLE book_authors;

        DROP TABLE books;

        DROP TABLE authors;

        DROP TABLE publishers;
        """))

In [29]:
# Let's inspect out database again to confirm that the tables were deleted
inspector = inspect(engine)

# Get the table names
table_names = inspector.get_table_names()

# Print the table names
print(f"Existing tables in the database: {table_names}")

Existing tables in the database: []